[
    {
        "title":"Mercury",
        "details":"Mercury (0.307-0.588 AU (45.9-88.0 million km; 28.5-54.7 million mi) from the Sun) is the closest planet to the Sun. The smallest planet in the Solar System (0.055 MEarth), Mercury has no natural satellites. The dominant geological features are impact craters or basins with ejecta blankets, the remains of early volcanic activity including magma flows, and lobed ridges or rupes that were probably produced by a period of contraction early in the planet's history. Mercury's very tenuous atmosphere consists of solar-wind particles trapped by Mercury's magnetic field, as well as atoms blasted off its surface by the solar wind. Its relatively large iron core and thin mantle have not yet been adequately explained. Hypotheses include that its outer layers were stripped off by a giant impact, or that it was prevented from fully accreting by the young Sun's energy.There have been searches for 'Vulcanoids', asteroids in stable orbits between Mercury and the Sun, but none have been discovered.",
        "image_url":"https://smd-cms.nasa.gov/wp-content/uploads/2023/11/mercury-messenger-globe-pia15162.jpg"
    },
    {
        "title":"Venus",
        "details":"Venus (0.718-0.728 AU (107.4-108.9 million km; 66.7-67.7 million mi) from the Sun) is close in size to Earth (0.815 MEarth) and, like Earth, has a thick silicate mantle around an iron core, a substantial atmosphere, and evidence of internal geological activity. It is much drier than Earth, and its atmosphere is ninety times as dense. Venus has no natural satellites. It is the hottest planet, with surface temperatures over 400 °C (752 °F), mainly due to the amount of greenhouse gases in the atmosphere.The planet has no magnetic field that would prevent the depletion of its substantial atmosphere, which suggests that its atmosphere is being replenished by volcanic eruptions. A relatively young planetary surface displays extensive evidence of volcanic activity, but is devoid of plate tectonics. It may undergo resurfacing episodes on a time scale of 700 million years.",
        "image_url":"https://smd-cms.nasa.gov/wp-content/uploads/2023/09/Venus.jpg?w=4096&format=jpeg"
    },
    {
        "title":"Earth",
        "details":"Earth (0.983-1.017 AU (147.1-152.1 million km; 91.4-94.5 million mi) from the Sun) is the largest and densest of the inner planets, the only one known to have current geological activity, and the only place in the universe where life is known to exist.Its liquid hydrosphere is unique among the terrestrial planets, and it is the only planet where plate tectonics has been observed.Earth's atmosphere is radically different from those of the other planets, having been altered by the presence of life to contain 21% free oxygen.The planetary magnetosphere shields the surface from solar and cosmic radiation, limiting atmospheric stripping and maintaining habitability.It has one natural satellite, the Moon, the only large satellite of a terrestrial planet in the Solar System.",
        "image_url":"https://cdn.mos.cms.futurecdn.net/FaWKMJQnr2PFcYCmEyfiTm-1200-80.jpg"
    },
    {
        "title":"Mars",
        "details":"Mars (1.382-1.666 AU (206.7-249.2 million km; 128.5-154.9 million mi) from the Sun) is smaller than Earth and Venus (0.107 MEarth). It has an atmosphere of mostly carbon dioxide with a surface pressure of 6.1 millibars (0.088 psi; 0.18 inHg); roughly 0.6% of that of Earth but sufficient to support weather phenomena.Its surface, peppered with volcanoes, such as Olympus Mons, and rift valleys, such as Valles Marineris, shows geological activity that may have persisted until as recently as 2 million years ago.Its red color comes from iron oxide (rust) in its soil, while the polar regions show white ice caps consisting largely of water.Mars has two tiny natural satellites (Deimos and Phobos) thought to be either captured asteroids, or ejected debris from a massive impact early in Mars's history.",
        "image_url":"https://smd-cms.nasa.gov/wp-content/uploads/2016/05/1-mars-nasa-gov-jpg.webp?w=4096&format=png&crop=1"
    },
    {
        "title":"Jupiter",
        "details":"Jupiter (4.951-5.457 AU (740.7-816.4 million km; 460.2-507.3 million mi) from the Sun), at 318 MEarth, is 2.5 times the mass of all the other planets put together. It is composed largely of hydrogen and helium. Jupiter's strong internal heat creates semi-permanent features in its atmosphere, such as cloud bands and the Great Red Spot. The planet possesses a 4.2-14 Gauss strength magnetosphere that spans 22-29 million km, making it, in certain respects, the largest object in the Solar System.Jupiter has 95 known satellites. The four largest, Ganymede, Callisto, Io, and Europa, are called the Galilean moons: they show similarities to the terrestrial planets, such as volcanism and internal heating.Ganymede, the largest satellite in the Solar System, is larger than Mercury; Callisto is almost as large.",
        "image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Jupiter_New_Horizons.jpg/290px-Jupiter_New_Horizons.jpg"
    },
    {
        "title":"Saturn",
        "details":"Saturn (9.075-10.07 AU (1.3576-1.5065 billion km; 843.6-936.1 million mi) from the Sun), distinguished by its extensive ring system, has several similarities to Jupiter, such as its atmospheric composition and magnetosphere. Although Saturn has 60% of Jupiter's volume, it is less than a third as massive, at 95 MEarth. Saturn is the only planet of the Solar System that is less dense than water. The rings of Saturn are made up of small ice and rock particles.Saturn has 145 confirmed satellites composed largely of ice. Two of these, Titan and Enceladus, show signs of geological activity;they, as well as five other Saturnian moons (Iapetus, Rhea, Dione, Tethys, and Mimas), are large enough to be round. Titan, the second-largest moon in the Solar System, is bigger than Mercury and the only satellite in the Solar System to have a substantial atmosphere.",
        "image_url":"https://smd-cms.nasa.gov/wp-content/uploads/2023/06/pia21046-jpg.webp"
    },
    {
        "title":"Uranus",
        "details":"Uranus (18.27-20.06 AU (2.733-3.001 billion km; 1.698-1.865 billion mi) from the Sun), at 14 MEarth, has the lowest mass of the outer planets. Uniquely among the planets, it orbits the Sun on its side; its axial tilt is over ninety degrees to the ecliptic. This gives the planet extreme seasonal variation as each pole points toward and then away from the Sun.It has a much colder core than the other giant planets and radiates very little heat into space.As a consequence, it has the coldest planetary atmosphere in the Solar System.Uranus has 27 known satellites, the largest ones being Titania, Oberon, Umbriel, Ariel, and Miranda.Like the other giant planets, it possesses a ring system and magnetosphere.",
        "image_url":"https://upload.wikimedia.org/wikipedia/commons/c/c9/Uranus_as_seen_by_NASA%27s_Voyager_2_%28remastered%29_-_JPEG_converted.jpg"
    },
    {
        "title":"Neptune",
        "details":"Neptune (29.89-30.47 AU (4.471-4.558 billion km; 2.778-2.832 billion mi) from the Sun), though slightly smaller than Uranus, is more massive (17 MEarth) and hence more dense. It radiates more internal heat than Uranus, but not as much as Jupiter or Saturn. Neptune has 14 known satellites. The largest, Triton, is geologically active, with geysers of liquid nitrogen.Triton is the only large satellite with a retrograde orbit, which indicates that it did not form with Neptune, but was probably captured from the Kuiper belt.Neptune is accompanied in its orbit by several minor planets, termed Neptune trojans, that either lead or trail the planet by about one-sixth of the way around the Sun, positions known as Lagrange points.",
        "image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Neptune_-_Voyager_2_%2829347980845%29_flatten_crop.jpg/800px-Neptune_-_Voyager_2_%2829347980845%29_flatten_crop.jpg"
    }
]